Белгипрозем_2017/src/Catalogs/СертификатыЭП/СертификатыЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыЭП</name>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоСертификату</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапомнитьПарольКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеКратко</name>
    <comment>Человекопонятное назначение сертификата, вводимое пользователем</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьДоступКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещенОСрокеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Пользователь, кому доступен сертификат подписи</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСоставИсполнителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <comment>Двоичные данные сертификата</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНастроекКриптографии</name>
    <type>
      <types>CatalogRef.ПрофилиНастроекКриптографии</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Усиленный</name>
    <comment>Сертификат является усиленным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДокументов</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляПодписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставИсполнителей</name>
    <comment>Список пользователей, после утверждения или подписания которых, документ переходит на подпись по данному сертификату</comment>
    <attributes>
      <name>Исполнитель</name>
      <comment>Пользователь или группа пользователей</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/СертификатыЭП/ManagerModule.bsl
Процедура ЗаполнитьСрокДействия() Экспорт
	
	Сертификаты = Справочники.СертификатыЭП.Выбрать();
	
	Пока Сертификаты.Следующий() Цикл
		
		Попытка
			Сертификат = Сертификаты.ПолучитьОбъект();
			ДанныеСертификата = Сертификат.ФайлСертификата.Получить();
			Если ТипЗнч(ДанныеСертификата) = Тип("ДвоичныеДанные") Тогда
				СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата);
				Сертификат.ДатаОкончания = СертификатКриптографии.ДатаОкончания;
				Сертификат.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаВыбора" ИЛИ Не Параметры.Свойство("ТипОперации") Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.ТипОперации = "ВыборИзХранилища" Тогда
		
		ВыбраннаяФорма = "ВыборСертификатаИзХранилища";
		
	ИначеЕсли Параметры.ТипОперации = "Подписание" Тогда
		
		СертификатыПользователя = РаботаСЭП.ПолучитьСертификатыТекущегоПользователя();
		Если СертификатыПользователя.Количество() = 1 Тогда
			Параметры.Вставить("СертификатДляПодписания", СертификатыПользователя[0].Ссылка);
			ВыбраннаяФорма = "ВыборСертификатаДляПодписанияЕдинственныйСертификат";
		Иначе
			Параметры.Вставить("СертификатыПользователя", СертификатыПользователя);
			ВыбраннаяФорма = "ВыборСертификатаДляПодписания";
		КонецЕсли;
		
	ИначеЕсли Параметры.ТипОперации = "Шифрование" Тогда
		
		ВыбраннаяФорма = "ВыборСертификатовДляШифрования";
		
	ИначеЕсли Параметры.ТипОперации = "Расшифрование" Тогда
		
		// Отбор сертификатов, которыми зашифрован файл.
		ЗашифрованныйФайл = Параметры.ФайлСсылка;
		ОтпечаткиСертификатовШифрования = ЗашифрованныйФайл.СертификатыШифрования.ВыгрузитьКолонку("Отпечаток");
		ВсеСертификатыПользователя = РаботаСЭП.ПолучитьСертификатыТекущегоПользователя();
		СертификатыПользователя = ВсеСертификатыПользователя.СкопироватьКолонки();
		СертификатыПользователя.Очистить();
		Для Каждого Сертификат Из ВсеСертификатыПользователя Цикл
			Если ОтпечаткиСертификатовШифрования.Найти(Сертификат.Отпечаток) <> Неопределено Тогда
				НоваяСтрока = СертификатыПользователя.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Сертификат);
			КонецЕсли;
		КонецЦикла;
		
		Если СертификатыПользователя.Количество() = 1 Тогда
			Параметры.Вставить("СертификатДляРасшифрования", СертификатыПользователя[0].Ссылка);
			ВыбраннаяФорма = "ВыборСертификатаДляРасшифрованияЕдинственныйСертификат";
		Иначе
			Параметры.Вставить("СертификатыПользователя", СертификатыПользователя);
			ВыбраннаяФорма = "ВыборСертификатаДляРасшифрования";
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Удалить("ТипОперации");
	
КонецПроцедуры
